jakob_wildlife_tracker/app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
    def index
        animals = Animal.all

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "sightings".* FROM "sightings" WHERE "sightings"."animal_id" = $1  [["animal_id", 2]]
---
    def show
        animal = Animal.find(params[:id])
        sighting = Sighting.where(:animal_id => animal.id)

INSERT INTO "animals" ("common_name", "latin_name", "kingdom", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        animal = Animal.create(animal_params)

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "animals" SET "common_name" = $1, "updated_at" = $2 WHERE "animals"."id" = $3  [["common_name", "White-tailed Deer"], ["updated_at", "2020-08-05 20:58:24.095610"], ["id", 5]]
---
    def update
        animal = Animal.find(params[:id])
        animal.update(animal_params)

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 4]]
---
    def destroy
        animal = Animal.find(params[:id])
        if animal.destroy