jakob_wildlife_tracker/app/controllers/sightings_controller.rb

SELECT "sightings".* FROM "sightings" WHERE "sightings"."date" BETWEEN $1 AND $2  [["date", "2020-08-05 00:00:00"], ["date", "2020-08-06 00:00:00"]]
---
    def index
        sightings = Sighting.where(date: params[:start_date]..params[:end_date])

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        sighting = Sighting.find(params[:id])

INSERT INTO "sightings" ("latitude", "longitude", "created_at", "updated_at", "date", "animal_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        sighting = Sighting.create(sighting_params)

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "sightings" SET "latitude" = $1, "updated_at" = $2 WHERE "sightings"."id" = $3  [["latitude", "46.5051° N"], ["updated_at", "2020-08-05 22:44:05.450719"], ["id", 1]]
---
    def update
        sighting = Sighting.find(params[:id])
        sighting.update(sighting_params)

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "sightings" WHERE "sightings"."id" = $1  [["id", 2]]
---
    def destroy
        sighting = Sighting.find(params[:id])
        if sighting.destroy